package com.electrolux.services;

import lombok.RequiredArgsConstructor;
import org.springframework.stereotype.Service;

@Service
@RequiredArgsConstructor
public class WathingMashineService {

    // Создает новую модель

    // Получает данные о модели по id

    // Удаляет текущую модель

    // Обновляет текущую модель

    // Загружает в текущую модель настройки стрирки из БД

    // первичная настройка, пользователь вводит свой ник который привязывается к существующей модели

    // пользователь переходит в режим "добавить пользовательский режим стирки"

    // пользователь выходит из режима "добавить пользовательский режим стирки"

    // пользователь сохраняет новую настройку в памяти Модели

    // пользователь подтверждает / отменяет свое действие

    // пользователь автивирует машину

    // пользователь переводит машину в режим сна

    // пользователь выбирает программу

    // пользователь отменяет программу

    // пользователь запускает стирку

    // пользователь отменяет стирку

    // пользователь запускает программу отчистки машины, применяется только когда машина засорилась, или когда
    // пользователь отменил стирку когда она не была завершена

}
